["Well, I don't know how anyone could wait\nThe weekend's up, they're trying to relate\nPointless conversations with people we don't know\nIf you agree then I think it's time to go\n\nI'm freaking out as people start to stare\nCan't get away from this song anywhere\nCan you hear me? Don't pick up your phone\nIs there a world where we can be alone?\n\nSneaking out, I'll try to meet you there\nWhite lights, now we're running down the stairs\nEverybody's wasted, throwing away their lives\nIt's all the same 'cause no one ever tries\n\nThrough all the sounds\n...\n\n\n(1409623348882)", "I'm in my head again, but it's fine (it's fine, yeah)\nCaught myself falling hard, it's a sign (this time), this time (this time)\nI like to think of you as mine (mine, yeah)\nI called you back again, but it's fine (it's fine), it's fine (it's fine)\n\nWe can go if you'd like to\nI can't go without you\nWe can go if you'd like to\nI can't go without you\n\nI've been running in circles, you're bruising up my heart\nAnd I wanna show you, I'll say it like\n\"Please stay, 'cause I really want you to want me\"\nYou say, \"Okay, I really want you to want me\"\n\nFound you in my head again, but it's fine (it's fine, yeah)\nI'll leave it up to you this time (this time), and it's fine 'cause\n...\n\n\n(1409623348882)", "I dream it all the time, girl\nWaking up warm in your arms and without a care\nNobody ain't a problem, girl\nJust give me the time and the place, and I'll be there, oh-oh\n\n'Cause I would go the distance for you, baby\nI'd travel 'round the world if you would let me\nI'll meet you where the sun it always shines\nYou're on my mind, all the time\nWe are not wasting this\n\n'Cause you and I, we're good together, oh\nYou always get me feeling better\nAnd I know you stay by my side\nYou make me feel much better\n'Cause girl, we're good together\n\nAnd I tell you all too much, girl\n...\n\n\n(1409623348882)", "I can just hear them now\n\"How could you let us down?\"\nBut they don't know what I found\nOr see it from this way 'round\n\nFeeling it overtake\nAll that I used to hate\nOne by one, every trait\nI tried, but it's way too late\nAll the signs I don't read\nTwo sides of me can't agree\nWill I be in too deep?\nGoing with what I always longed for\n\nFeel like a brand new person (but you'll make the same old mistakes)\nI don't care, I'm in love (stop before it's too late, I know)\nFeel like a brand new person (but you'll make the same old mistakes)\nI finally know what it's like (you don't have what it takes)\n\nStop before it's too late, I know there's too much at stake\n...\n\n\n(1409623348882)", "I've been hiding\nYou've been shining\nLike, diamonds blinding\n\nYou've been proving\nYou're superhuman\nI'm still moon-shooting\n\nThe way that you glow, everybody knows\nYou've got a heart of gold\nAnd mine is always broken\n...\n\n\n(1409623348882)", "Flyin' high like the birds and the bees\nAnd we'll fill the sky with these songs in the trees\n'Cause we're buzzin', buzzin'\nAnd we're hummin', hummin'\nAnd we're lovin', lovin' all day-ay-ay-ay\n\nFlyin' high like the birds and the bees\nAnd we'll feel alive while we float with the breeze\n'Cause we're buzzin', buzzin'\nAnd we're hummin', hummin'\nAnd we're lovin', lovin' all day-ay-ay-ay\n\nFeels good when I'm near you\nI got the whole world in our rearview\nBut when you're here, I can feel you\nLike a summer day in June\nMigrate from the bad times now\nLove crimes never held me down\nWeavin' through all these grapevines\nHow we gonna find our truth?\n\nThis flight can take you higher\nRise above all your fires\nTake you to your desires\nJust follow me\n\nFlyin' high like the birds and the bees\nAnd we'll fill the sky with these songs in the trees\n'Cause we're buzzin', buzzin'\nAnd we're hummin', hummin'\n...\n\n\n(1409623348882)", "I wonder what was in my head\nTo spill over into the words I said\nCan't help but think you read my mind\nYou were all I used to fixate on\n\nOoh Aah\nYou envision that it happens\nAnd Ooh Aah\nYou like getting what you want\n\nSometimes I want it back\n...\n\n\n(1409623348882)", "So ya thought ya\nMight like to go to the show?\nTo feel the warm thrill of confusion\nThat space cadet glow\n...\n\n\n(1409623348882)", "Can we go now?\n\nWeekend\nYou light my fire like a cigarette\nI see your colors\nNever forget me\nWe travel wild making our own streets\n\nHeart stop and I feel it even more, how?\nOur hands are cold, are you sure now?\n\nHotbox, quiet talks\nSwimming pools at night\nSkin sweet, incomplete\nBut you know what I like\nI love you, tenderly, tragically\nI love you, tenderly, tragically\n\n...\n\n\n(1409623348882)", "Remember when you were young? (Ha-ha-ha-ha)\nYou shone like the sun\n\nShine on, you crazy diamond\n\nNow there's a look in your eyes\nLike black holes in the sky\n\nShine on, you crazy diamond\n\nYou were caught in the crossfire\n...\n\n\n(1409623348882)", "Headed west now\nFrom the blighted plain\nIt's kind of gorgeous in a georgic way\nStaring outside\nWatching every change\nI think it's just a type of way to explain\n\nHow I miss you\nHow I hope you're fine\nThat I've been sad\nTracing Lichtenstein with my eyes closed\nOn the phone at night\n...\n\n\n(1409623348882)", "I do not want to fight this anymore\nI just want to lay back\nAnd watch you pin me to the bed\n\nI used to call you my best friend\nWay back before you were my everything\nNow I'm sucking your neck\n\nAnd you wrote my favorite song\nNow I'm fucked up and carrying on\nI do not know the words to it yet, oh\n\nAnd it hits me\nI don't want anybody else touching you like I do\nLike I do\nLike me\n\nIs it okay?\nThat I don't want anybody else touching you like I do\nLike I do\nLike me\nYeah\n\nTell me that nobody else touches you\n...\n\n\n(1409623348882)", "You can act all shy\nBut you know that I want you\nIn the dead of night\nI want to live with you\n\nSo terrified of the road that takes you\nMe too\nDon't modify, every one adores you\n...\n\n\n(1409623348882)", "She knows me\nShe knows me\n\nSometimes I have a weird way of showing my love\nAnd I always expect her to know what I'm thinking of\n\nShe knows me\n\nI treat her so mean I don't deserve what I have\nAnd I think that she'll forget just by making her laugh\nBut she knows me\n\nShe knows me too well\nKnows me so well\nThat she can tell\nI really love her\nShe knows me too well\n...\n\n\n(1409623348882)", "I'm frightened at night, and the wind has a roar\nIt seeps through the hall, and from under the door\nLike the shit that was said, I can't take it that well\nI give and I give and I give and I give and I'm still\n\nLost and hurt and bone thin from the love that's been starved\nI know I've got close but I'm sure it's too far\nFrom the point of suspense, we know it should be\nThe end of the part, of our favorite movie\n\nWhere the guy grabs the girl and gives her his hand\nSays \"take me away from this torturous land\"\n'Cause the grave is set up, the hole that I dug\nI gave and I gave and I gave and I gave you my trust\n\nLike the time that we kissed, and you gave me a lie\nTo add to this scene you pretended to cry\n...\n\n\n(1409623348882)", "I saw you lookin' for the side door\nYou didn't want to stick around for\nThe rest of the night\nI guess that's alright\n\nThey all left when you walked home\nIt makes sense that they all know\nIt was only for you\nIf only you knew\n\nWhat good is love\nWithout any strings?\nHeld it above\nStuck in-between\nTell me for once\nWhat that even means\nI wanna know you\nBut can't make it right\n\n...\n\n\n(1409623348882)", "Hanging out behind the club on the weekends\nActing stupid, getting drunk with my best friends\nI couldn't wait for the summer and the Warped Tour\nI remember it's the first time that I saw her there\n\nShe's getting kicked out of school 'cause she's failing\nI'm kinda nervous, 'cause I think all her friends hate me\nShe's the one, she'll always be there\nShe took my hand and I made it, I swear\n\nBecause I fell in love with the girl at the rock show\nShe said, \"What?\", and I told her that I didn't know\nShe's so cool, gonna sneak in through her window\nEverything's better when she's around\nI can't wait 'til her parents go out of town\nI fell in love with the girl at the rock show\n...\n\n\n(1409623348882)", "He pauses shaving and he tells himself that he is the bomb\nShe has her curlers set, her credit cards are paying the funds\nHe's not that old, I've been told a strong sexual goal\nHe goes out everyday she goes every way, oh yeah\nAnd they don't even care at all\n\nShe's open waiting for more\nAnd I know he's only looking to score\nAnd it is way to unhealthy\nOften they've typically\n...\n\n\n(1409623348882)", "You're quiet and I'm loud\nIt's never a bore, uh\nIt makes sense, the difference\nBut what's distance for?\nDo I make you feel something?\nSometimes I wanna feel nothin'\n\nDrive me crazy on the freeway\nYou go too fast, I get upset, babe\nAnd I hate it\nBut I just fake it\n\nBeach boy, be my bitch, babe\nIf it's only, for a day\nTake me out, but I won't stay\nBeach boy, be my beach babe\nBe my bitch\nFor a day, for a day\nBe my beach babe\n...\n\n\n(1409623348882)", "You're pulling my heart\nKeeping me up in the dark\nAnd I'm still on the chase\nStill haven't seen your face, but we're not far apart\n\nYou know I keep a collection\nOf my misplaced affections\nThe thought of you keeps grabbing my attention\nAnd have I even come close, I don't think so, no\n\nI just wanna see it for myself\nI never wanna do this alone\nHave you ever been in love?\n...\n\n\n(1409623348882)"]